app/views/posts/_form.html.erb


  <%= collection_check_boxes :post, :tag_ids, Tag.all, :id, :name %>
---
SELECT "tags".* FROM "tags"